In [244]:
#importing library files
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [245]:
data = pd.read_csv(r"C:\Users\mvsan\Downloads\classification_2 (1).csv")

In [246]:
data.head()

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [247]:
data.columns =  ['age', 'workarea', 'ID', 
           'education', 'education-year', 
           'marital-status', 'occupation', 
           'relationship', 'race', 'sex', 
           'capital-gain', 'capital-loss', 
           'hours-per-week', 'native-country', 
           'salary']

In [248]:
data.head()

,age,workarea,ID,education,education-year,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [249]:
data.describe()

,age,ID,education-year,capital-gain,capital-loss,hours-per-week
count,32560.000000,3.256000e+04,32560.000000,32560.000000,32560.000000,32560.000000
mean,38.581634,1.897818e+05,10.080590,1077.615172,87.306511,40.437469
std,13.640642,1.055498e+05,2.572709,7385.402999,402.966116,12.347618
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178315e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783630e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370545e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [250]:
data.isnull().sum()

age               0
workarea          0
ID                0
education         0
education-year    0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
salary            0
dtype: int64

In [251]:
data.head()

,age,workarea,ID,education,education-year,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [252]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32560 entries, 0 to 32559
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32560 non-null  int64
 1   workarea        32560 non-null  object
 2   ID              32560 non-null  int64
 3   education       32560 non-null  object
 4   education-year  32560 non-null  int64
 5   marital-status  32560 non-null  object
 6   occupation      32560 non-null  object
 7   relationship    32560 non-null  object
 8   race            32560 non-null  object
 9   sex             32560 non-null  object
 10  capital-gain    32560 non-null  int64
 11  capital-loss    32560 non-null  int64
 12  hours-per-week  32560 non-null  int64
 13  native-country  32560 non-null  object
 14  salary          32560 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [253]:
y = data["salary"]

In [254]:
y.unique()

array([' <=50K', ' >50K'], dtype=object)

In [255]:
y.replace([' <=50K',' >50K'],[0,1],inplace=True)

In [256]:
y

0        0
1        0
2        0
3        0
4        0
        ..
32555    0
32556    1
32557    0
32558    0
32559    1
Name: salary, Length: 32560, dtype: int64

In [257]:
drop_elements = ['native-country', 'salary','ID','marital-status','race','workarea','relationship','occupation','sex','education']

data.drop(drop_elements, axis=1,inplace=True)

In [258]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32560 entries, 0 to 32559
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32560 non-null  int64
 1   education-year  32560 non-null  int64
 2   capital-gain    32560 non-null  int64
 3   capital-loss    32560 non-null  int64
 4   hours-per-week  32560 non-null  int64
dtypes: int64(5)
memory usage: 1.2 MB

In [259]:
X= data

In [260]:
from sklearn.preprocessing import MinMaxScaler
ms=MinMaxScaler()
X=ms.fit_transform(X)

In [261]:
from sklearn.model_selection import train_test_split

X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=10)

In [262]:
X_train

array([[0.4109589 , 0.53333333, 0.        , 0.45316804, 0.39795918],
       [0.09589041, 0.6       , 0.        , 0.        , 0.39795918],
       [0.08219178, 0.66666667, 0.        , 0.        , 0.5       ],
       ...,
       [0.20547945, 0.53333333, 0.        , 0.        , 0.5       ],
       [0.49315068, 0.53333333, 0.        , 0.        , 0.39795918],
       [0.26027397, 0.53333333, 0.        , 0.        , 0.90816327]])

In [263]:
y_train

12176    0
190      0
22645    0
4802     0
16052    1
        ..
28017    0
17728    1
29199    0
7293     1
17673    0
Name: salary, Length: 26048, dtype: int64

In [264]:
X_train.shape

(26048, 5)

In [265]:
a=0
b=0
c=0
d=0
e=0
f=0

#learning rate
L = 0.01 
#epoch for mininum iterations to find minimum rss/mse
epochs = 1000  

#number of observations
n = float(len(X_train)) 

for i in range(epochs): 
    z = a+b*X_train[:,0]+c*X_train[:,1]+d*X_train[:,2]+e*X_train[:,3]+f*X_train[:,4]
    h=1/(1+np.exp(-z))
    
    D_a = (1/n) * sum(h-y_train)
    D_b = (1/n) * sum(X_train[:,0] * (h-y_train))
    D_c = (1/n) * sum(X_train[:,1] * (h-y_train)) 
    D_d = (1/n) * sum(X_train[:,2] * (h-y_train))   
    D_e = (1/n) * sum(X_train[:,3] * (h-y_train))
    D_f = (1/n) * sum(X_train[:,4] * (h-y_train))
   
    a = a - L * D_a  
    b = b - L * D_b
    c = c - L * D_c  
    d = d - L * D_d
    e = e - L * D_e
    f = f - L * D_f
    
    
print (a,b,c,d,e,f)

-0.7940253506948561 -0.0404795528982191 -0.22123268429386847 0.06253953309910867 0.04374549539462428 -0.1867106598109393

In [266]:
z1=-0.79402535069485619+-0.0404795528982191*X_test[:,0]+-0.22123268429386847*X_test[:,1]+0.06253953309910867*X_test[:,2]+0.04374549539462428*X_test[:,3]+-0.1867106598109393*X_test[:,3]
h_result=1/(1+np.exp(-z1))

In [267]:
y_pred=[]

for i in range(len(h_result)):
    if h_result[i]>0.5:
        y_pred.append(1)
    elif h_result[i]<0.5:
        y_pred.append(0)

In [268]:
h_result

array([0.27203547, 0.28122167, 0.2857945 , ..., 0.28292644, 0.28432537,
       0.26781773])

In [269]:
from sklearn.metrics import accuracy_score, confusion_matrix
accuracy_score(y_pred,y_test)

0.764588452088452